
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Коробка.РедактированиеТекста = Истина;
	
	Коробка = "";
	Элементы.Коробка.ОбновитьТекстРедактирования();
	Элементы.Коробка.Видимость = Ложь;
	Элементы.Коробка.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Коробка;
	#Если МобильныйКлиент Тогда    
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура КоробкаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Коробка) Тогда
			Закрыть(Коробка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоследнийНомер = Параметры.ПоследнийНомер;
	
КонецПроцедуры
