Функция Price()  Экспорт
	Файл=Новый ЗаписьXML;
	Файл.УстановитьСтроку();
	Файл.ЗаписатьОбъявлениеXML();
	Файл.ЗаписатьНачалоЭлемента("korn");
    Файл.ЗаписатьАтрибут("spr","Прайс-лист компании");
	Выборка=Справочники.Номенклатура.ВыбратьИерархически();
	Пока Выборка.Следующий() Цикл
		Файл.ЗаписатьНачалоЭлемента("elem");
		Файл.ЗаписатьАтрибут("caption",Строка(Выборка.Наименование));
		Файл.ЗаписатьАтрибут("cost",Строка(Выборка.ЦенаПродажи));
		Файл.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	Файл.ЗаписатьКонецЭлемента();
	
	СтрXML=Файл.Закрыть();
	Преобразование=Новый ПреобразованиеXSL;
	Преобразование.ЗагрузитьИзФайла("C:/web/base/price.xsl");
	ЗначениеПреобразования=Преобразование.ПреобразоватьИзСтроки(СтрXML);
    Возврат(ЗначениеПреобразования);
	
КонецФункции	
