
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 Инвентаризация = Параметры.Инвентаризация;
	 НомерПросчета 	= Параметры.НомерПросчета;
	 Ячейка			= Параметры.Ячейка;
	 СкладИнвентаризации = Инвентаризация.Склад;
	 
	 ОбновитьСписок();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()

	ТЗ = РСК_ТСД.ПолучитьНоменклатуруФактВЯчейкеПоПросчетуПоРегиструИнвентарь(Инвентаризация, Ячейка, НомерПросчета);
	ТЗ.колонки.Удалить("Ячейка");
	ТЗ.колонки.Удалить("Упаковка");
	ЗначениеВРеквизитФормы(ТЗ,"Список");
	
КонецПроцедуры // ОбновитьСписок()

&НаКлиенте
Процедура ЯчейкаПриИзменении(Элемент)
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Попытка
	
		ВК.ИнициализироватьСканер(Ложь, Истина);	
	
	Исключение
		
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Попытка
	
		ВК.ОтключитьСканер();
	
	Исключение
	
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование"
		И ИмяСобытия = "Barcode"
		И ВводДоступен()	// нужен ли ВводДоступен() в окне где нет определённого поля, куда сканировать ?
		Тогда
		//проверка даты на сервере и на ТСД
		//Сообщить("ТекущаяДата() на клиенте:" + ТекущаяДата());
		//Сообщить("ТекущаяДата() на сервере:" + ПолучитьТекущаяДатанаСервере());
		//Сообщить("ТекущаяДатаСеанса() на сервере:" + ПолучитьТекущаяДатаСеансаНаСервере());
		
		Штрихкод = Параметр;
		//Сообщить(Штрихкод);
		// ищем номенклатуру
		ОбработатьШтрихкод(Штрихкод);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод)

	Структура = 			РСК_ТСД.НайтиНоменклатуруУпаковкуПоШтрихкоду(Штрихкод);
	Номенклатура = 			Структура.Номенклатура;
	УпаковкаПоШтрихкоду = 	Структура.УпаковкаПоШтрихкоду;
	
	Если НЕ ЗначениеЗаполнено(Структура.Номенклатура) Тогда
		МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
		Предупреждение("Номенклатура с таким Штрихкодом не существует !");
		Возврат;
	КонецЕсли;
	
	МинимУпаковка = РСК_ТСД.ПолучитьУпаковкуПоЕдИзмНоменклатуры(Структура.Номенклатура);
	
	Если НЕ ЗначениеЗаполнено(УпаковкаПоШтрихкоду) Тогда
		МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
		Предупреждение("Упаковка с таким Штрихкодом не существует !");
		Возврат;
	КонецЕсли;
	Парам = Новый Структура("Инвентаризация, НомерПросчета, Ячейка, МинимУпаковка, Номенклатура", Инвентаризация, НомерПросчета, Ячейка, МинимУпаковка, Структура.Номенклатура ); 
	КоличествоДобавить = ?(ВводПоШтучно, ПолучитьКоэфУпаковки(МинимУпаковка), ОткрытьФормуМодально("Обработка.ТСД_РСК.Форма.РСК_ВводКоличестваИнвентаризация", Парам)); 

	Если КоличествоДобавить > 0 Тогда
		
		Удачно = РСК_ТСД.ЗаписатьИвентарьПриход(Инвентаризация,Ячейка,РСК_ТСД.ПолучитьТекущегоПользователяНаСервере(),НомерПросчета,Номенклатура,МинимУпаковка,КоличествоДобавить);
		Если Удачно Тогда
			
			ВыделитьСтрокуСНоменклатуройЦветом(Структура.Номенклатура);
			
			ОбновитьСписок();
			
			УстановитьТекущуюСтроку(Структура.Номенклатура);
			
			МобильныйКлиент.ОповещениеКороткоеОдинСигнал();
		Иначе
			МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
		КонецЕсли;
		
		
		
		
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.Список;
	
КонецПроцедуры // ОбработатьШтрихкод()

&НаСервере
Процедура ВыделитьСтрокуСНоменклатуройЦветом(Знач Номенклатура)
	
	//условное оформление
	//УсловноеОформление.Элементы.Очистить()
	УсловноеОформление.Элементы[0].Отбор.Элементы[0].ПравоеЗначение 	= Номенклатура;
	УсловноеОформление.Элементы[0].Отбор.Элементы[0].Использование		= Истина;
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТЗНоменклатура");
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТЗ.Номенклатура");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = СтрокаТЧПоступления.Номенклатура;
	////Элемент.Использование = Истина;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗолотистый);

КонецПроцедуры

&НаСервере
Функция ПолучитьКоэфУпаковки(Знач Упаковка_)
	
	Возврат Упаковка_.Коэффициент;

КонецФункции // ОбработатьШтрихкод(Штрихкод)()

&НаКлиенте
Процедура УстановитьТекущуюСтроку(Знач Номенклатура)
	
	Перем СтрокиСНоменклатурой;
	
	//выделить строку с отсканированной номенклатурой. Найти надо по текущему коробу именно
	СтрокиСНоменклатурой = Список.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
	Если СтрокиСНоменклатурой.Количество() > 0 тогда
		Элементы.Список.ТекущаяСтрока = СтрокиСНоменклатурой[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Список.НайтиПоИдентификатору(ВыбраннаяСтрока);
	МинимУпаковка = РСК_ТСД.ПолучитьУпаковкуПоЕдИзмНоменклатуры(ТекущиеДанные.Номенклатура);
	Структура =	Новый Структура("Номенклатура, УпаковкаПоШтрихкоду, МинимУпаковка", ТекущиеДанные.Номенклатура, , МинимУпаковка);
	// нашли - Структура("Номенклатура, УпаковкаПоШтрихкоду, МинимУпаковка (по ед. изм. номенклатуры)"
	
	МассивДействий = Новый Массив;
	МассивДействий.Добавить("ДобавитьКоличество");
	МассивДействий.Добавить("УдалитьКоличество");
	МассивДействий.Добавить("УдалитьСтроку");
	//МассивДействий.Добавить("ДобавитьНовуюНоменклатуру");
	МассивДействий.Добавить("Отмена");
	
	Парам = Новый Структура("МассивДействий, Номенклатура", МассивДействий, ТекущиеДанные.Номенклатура);
	Ответ = ОткрытьФормуМодально("Обработка.ТСД_РСК.Форма.ДействияСНоменклатурой",Парам);
	Если Не ЗначениеЗаполнено(Ответ) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Ответ = "ДобавитьКоличество" Тогда
			
			Парам = Новый Структура("Инвентаризация, НомерПросчета, Ячейка, МинимУпаковка, Номенклатура", Инвентаризация, НомерПросчета, Ячейка, МинимУпаковка, Структура.Номенклатура );
			КоличествоДобавить = ОткрытьФормуМодально("Обработка.ТСД_РСК.Форма.РСК_ВводКоличестваИнвентаризация", Парам);
			КоличествоДобавить = ?(ЗначениеЗаполнено(КоличествоДобавить), КоличествоДобавить, 0);
			
			Если КоличествоДобавить > 0 Тогда
				Удачно = РСК_ТСД.ЗаписатьИвентарьПриход(Инвентаризация,Ячейка,РСК_ТСД.ПолучитьТекущегоПользователяНаСервере(),НомерПросчета,Структура.Номенклатура,МинимУпаковка,КоличествоДобавить);
				Если Удачно Тогда
					
					ВыделитьСтрокуСНоменклатуройЦветом(Структура.Номенклатура);
					ОбновитьСписок();
					УстановитьТекущуюСтроку(Структура.Номенклатура);
					
					МобильныйКлиент.ОповещениеКороткоеОдинСигнал();
				Иначе
					МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
				КонецЕсли;			
			КонецЕсли;
			
		ИначеЕсли Ответ = "УдалитьКоличество" Тогда
			Парам = Новый Структура("Инвентаризация, НомерПросчета, Ячейка, МинимУпаковка, Номенклатура", Инвентаризация, НомерПросчета, Ячейка, МинимУпаковка, Структура.Номенклатура );
			КоличествоУдалить = ОткрытьФормуМодально("Обработка.ТСД_РСК.Форма.РСК_ВводКоличестваИнвентаризация", Парам);
			КоличествоУдалить = ?(ЗначениеЗаполнено(КоличествоУдалить), КоличествоУдалить, 0);
			
			Если КоличествоУдалить > 0 Тогда
				Удачно = РСК_ТСД.ЗаписатьИнвентарьРасход(Инвентаризация,Ячейка,РСК_ТСД.ПолучитьТекущегоПользователяНаСервере(),НомерПросчета,Структура.Номенклатура,МинимУпаковка,КоличествоУдалить);
				Если Удачно Тогда
					
					ВыделитьСтрокуСНоменклатуройЦветом(Структура.Номенклатура);
					ОбновитьСписок();
					УстановитьТекущуюСтроку(Структура.Номенклатура);
					
					МобильныйКлиент.ОповещениеКороткоеОдинСигнал();
				Иначе
					МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
				КонецЕсли;			
			КонецЕсли;

			
		ИначеЕсли Ответ = "УдалитьСтроку" Тогда
			Ответ = Вопрос("Действительно Удалить строку с номенклатурой и всё кол-во ?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
					Удачно = РСК_ТСД.ЗаписатьИнвентарьРасход(Инвентаризация,Ячейка,РСК_ТСД.ПолучитьТекущегоПользователяНаСервере(),НомерПросчета,Структура.Номенклатура,МинимУпаковка,ТекущиеДанные.Факт);
					Если Удачно Тогда
						
						ВыделитьСтрокуСНоменклатуройЦветом(Структура.Номенклатура);
						ОбновитьСписок();
						//УстановитьТекущуюСтроку(Структура.Номенклатура);
						
						МобильныйКлиент.ОповещениеКороткоеОдинСигнал();
					Иначе
						МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
					КонецЕсли;			
				
			КонецЕсли;
			
		//ИначеЕсли Ответ = "ДобавитьНовуюНоменклатуру" Тогда
			//
			
		КонецЕсли;
		ЭтаФорма.ТекущийЭлемент = Элементы.Список;
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВручную(Команда)
	
	ПараметрыФормы = Новый Структура("Инвентаризация, НомерПросчета, Ячейка", Инвентаризация, НомерПросчета, Ячейка); 
	СтруктураОтвет = ОткрытьФормуМодально("Обработка.ТСД_РСК.Форма.РСК_ВводКоличестваИнвентаризацияНоваяВручную",ПараметрыФормы);
	СтруктураОтвет.КоличествоДобавить = ?(ЗначениеЗаполнено(СтруктураОтвет.КоличествоДобавить), СтруктураОтвет.КоличествоДобавить, 0);
	Если СтруктураОтвет.КоличествоДобавить > 0 Тогда
		Удачно = РСК_ТСД.ЗаписатьИвентарьПриход(Инвентаризация,Ячейка,РСК_ТСД.ПолучитьТекущегоПользователяНаСервере(),НомерПросчета,СтруктураОтвет.Номенклатура,СтруктураОтвет.МинимУпаковка,СтруктураОтвет.КоличествоДобавить);
		Если Удачно Тогда
			
			ВыделитьСтрокуСНоменклатуройЦветом(СтруктураОтвет.Номенклатура);
			ОбновитьСписок();
			УстановитьТекущуюСтроку(СтруктураОтвет.Номенклатура);
			
			МобильныйКлиент.ОповещениеКороткоеОдинСигнал();
		Иначе
			МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
		КонецЕсли;			
	КонецЕсли;
КонецПроцедуры
