
Процедура КнопкаВыгрузить(Кнопка)
	Чтение=Новый ЧтениеXML;
	Чтение.ОткрытьФайл(СокрЛП(Константы.ПутьДоФайлов.Получить())+"\ДанныеНоменклатуры.xsd");
	
	НовыйПостроительДом=Новый ПостроительDOM;
	НовыйДокументДом=НовыйПостроительДом.Прочитать(Чтение);
	
	НовыйПостроительСхем=Новый ПостроительСхемXML;
	НоваяСхема=НовыйПостроительСхем.СоздатьСхемуXML(НовыйДокументДом);
	
	НаборСхем=Новый НаборСхемXML;
	НаборСхем.Добавить(НоваяСхема);
	НоваяФабрика=Новый ФабрикаXDTO(НаборСхем);
	
	НоменклатураТип = НоваяФабрика.Тип("http://www.1c.ru/demos/products", "Номенклатура");
	НоменклатураГруппаТип = НоваяФабрика.Тип("http://www.1c.ru/demos/products", "НоменклатураГруппа");
	
	КорневаяГруппа = НоваяФабрика.Создать(НоменклатураГруппаТип);
	КорневаяГруппа.Наименование = "Корневая";
	
	
	Номенклатура = НоваяФабрика.Создать(НоменклатураТип);
	Номенклатура.Наименование = НоменклатураСсылка.Наименование;
	Номенклатура.ЗакупочнаяЦена = 1000;
	
	Номенклатура.ПолноеНаименование = НоменклатураСсылка.Наименование;
	Номенклатура.ШтрихКод = НоменклатураСсылка.Код;
	
	КорневаяГруппа.Элементы.Добавить(Номенклатура);
	
	Запись=Новый ЗаписьXML;
	Запись.ОткрытьФайл(СокрЛП(Константы.ПутьДоФайлов.Получить())+"\out.xml");
	НоваяФабрика.ЗаписатьXML(Запись,КорневаяГруппа,,,,НазначениеТипаXML.Явное);
	Запись.Закрыть();
	
КонецПроцедуры

Процедура Загрузить(Кнопка)
	Чтение=Новый ЧтениеXML;
	Чтение.ОткрытьФайл(СокрЛП(Константы.ПутьДоФайлов.Получить())+"\ДанныеНоменклатуры.xsd");
	
	НовыйПостроительДом=Новый ПостроительDOM;
	НовыйДокументДом=НовыйПостроительДом.Прочитать(Чтение);
	
	НовыйПостроительСхем=Новый ПостроительСхемXML;
	НоваяСхема=НовыйПостроительСхем.СоздатьСхемуXML(НовыйДокументДом);
	
	НаборСхем=Новый НаборСхемXML;
	НаборСхем.Добавить(НоваяСхема);
	НоваяФабрика=Новый ФабрикаXDTO(НаборСхем);
	
	Чтение=Новый ЧтениеXML;
	Чтение.ОткрытьФайл(СокрЛП(Константы.ПутьДоФайлов.Получить())+"\new.xml");
	Данные=НоваяФабрика.ПрочитатьXML(Чтение);
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	//далее обработка данных
КонецПроцедуры
