Процедура КнопкаВыгрузить(Кнопка)
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	ТоварТип = ФабрикаXDTO.Тип("http://www.sample-package.org", "Товар");
	ДокТип = ФабрикаXDTO.Тип("http://www.sample-package.org", "Док");
	СтрокаТЧТип = ФабрикаXDTO.Тип("http://www.sample-package.org", "СтрокаТЧ");
	ДенежныйТип = ФабрикаXDTO.Тип("http://www.sample-package.org", "Денежный");
	
	Корень = ФабрикаXDTO.Создать(ДокТип);	//Док
	Корень.Дата = Документ.Дата;
	Корень.Номер = Документ.Номер;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТоваровТовары.Номенклатура.Наименование КАК Наименование,
		|	ПродажаТоваровТовары.Номенклатура.Услуга КАК Услуга,
		|	ПродажаТоваровТовары.Номенклатура.ЦенаПродажи КАК ЦенаПродажи,
		|	ПродажаТоваровТовары.Количество,
		|	ПродажаТоваровТовары.Цена,
		|	ПродажаТоваровТовары.Сумма
		|ИЗ
		|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
		|ГДЕ
		|	ПродажаТоваровТовары.Ссылка = &Док";
	
	Запрос.УстановитьПараметр("Док", Документ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаТЧ = ФабрикаXDTO.Создать(СтрокаТЧТип);	//определять типы обязательно в цикое
		Товар = ФабрикаXDTO.Создать(ТоварТип);
		ЗаполнитьЗначенияСвойств(Товар,ВыборкаДетальныеЗаписи);
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,ВыборкаДетальныеЗаписи);
		СтрокаТЧ.Товар = Товар;
		
		Корень.СтрокаТЧ.Добавить(СтрокаТЧ);
	КонецЦикла;
		
	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл(СокрЛП(Константы.ПутьДоФайлов.Получить())+"\new.xml");
	ФабрикаXDTO.ЗаписатьXML(Запись,Корень,,,,НазначениеТипаXML.Явное);
	Запись.Закрыть();
КонецПроцедуры
