Процедура КнопкаВыполнитьНажатие(Кнопка)
	ТоварТип = ФабрикаXDTO.Тип("http://www.sample-package.org", "Товар");
	СоставТип = ФабрикаXDTO.Тип("http://www.sample-package.org", "СписокТоваров");
	
	Запись=Новый ЗаписьXML;
	Запись.ОткрытьФайл(СокрЛП(Константы.ПутьДоФайлов.Получить())+"\new.xml");
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("Контейнер");
	Запись.ЗаписатьСоответствиеПространстваИмен("","http://www.sample-package.org");
	Запись.ЗаписатьСоответствиеПространстваИмен("xsd","http://www.w3.org/2001/XMLSchema");
	Запись.ЗаписатьСоответствиеПространстваИмен("xsi","http://www.w3.org/2001/XMLSchema-instance");
	
	Для Счетчик=1 По 10000 Цикл
		
		Элемент=ФабрикаXDTO.Создать(ТоварТип);
		Элемент.Наименование="Одинаковое наименование справочника";
		Элемент.Услуга=Ложь;
		Элемент.ЦенаПродажи=100;
		
		ФабрикаXDTO.ЗаписатьXML(Запись,Элемент,,,,НазначениеТипаXML.Явное);
	
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();
	Запись.Закрыть();
КонецПроцедуры