
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Параметры.Номенклатура;
		номерДекорации = 2;
		Для каждого ИмяДействие из Параметры.МассивДействий Цикл
			
			// Добавляем команду формы
			НоваяКоманда = ЭтаФорма.Команды.Добавить(ИмяДействие);
			// Свойство "Действие" содержит имя процедуры-обработчика команды
			НоваяКоманда.Действие = "Предупредить";
			НоваяКоманда.Заголовок = СформироватьЗаголовок(ИмяДействие);
			
			// Добавляем элемент "КомандаПредупредить" с типом "Кнопка формы"
			НовыйЭлемент = Элементы.Добавить("Команда"+ИмяДействие, Тип("КнопкаФормы"));
			// Присваиваем команду для созданной кнопке
			НовыйЭлемент.ИмяКоманды = НоваяКоманда.Имя;
			
			НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
			Шрифт = Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,10,);
			НовыйЭлемент.Шрифт = Шрифт;
			НовыйЭлемент.ЦветФона = WebЦвета.СветлоЗолотистый;
			
			//добавить декорацию чтобы разделить интервалом кнопки
			НовыйЭлемент = Элементы.Добавить("Декорация" + номерДекорации,тип("ДекорацияФормы"));
			
			
			номерДекорации = номерДекорации + 1;
		КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Предупредить(Элемент)
	
	Закрыть(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
Функция СформироватьЗаголовок(ИмяДействие)
	
	ПолнаяСтрока = Лев(ИмяДействие,1);
	
	Для н = 2 по СтрДлина(ИмяДействие) Цикл
		
		Буква = Сред(ИмяДействие, н, 1);
		
		Если Буква = ВРег(Буква) Тогда
			
			//заглавная буква, ставим перед ней пробел
			
			ПолнаяСтрока = ПолнаяСтрока +" "+ Буква;
		Иначе
			
			ПолнаяСтрока = ПолнаяСтрока + Буква;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПолнаяСтрока;
КонецФункции // СформироватьЗаголовок()

&НаСервере
Функция ПреобразованиеСтрокиБезПробелов(СтрокаБезПробелов)
 
	СтрокаСПробелами = Лев(СтрокаБезПробелов,1);
	
	Для к = 2 По СтрДлина(СтрокаБезПробелов) Цикл
		ТекущийЗнак = Сред(СтрокаБезПробелов,к,1);
		КодСимвола = КодСимвола(ТекущийЗнак);
		Если (КодСимвола > 64 И КодСимвола < 91) Или (КодСимвола > 1039 И КодСимвола < 1072)  Тогда
			СтрокаСПробелами = СтрокаСПробелами + " " + НРег(ТекущийЗнак);
		Иначе
			СтрокаСПробелами = СтрокаСПробелами + ТекущийЗнак;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат  СтрокаСПробелами;
	
КонецФункции

