
&НаКлиенте
Процедура НаКлиенте(Команда)
	//V8=УстановитьOLEСоединение(СформироватьСтрокуПодключения());;
	//
	//Сообщить(V8.Константы.Задваивать.Получить());
	//Номен=V8.Справочники.Номенклатура;
	//НовыйЭл=Номен.СоздатьЭлемент();       
	//НовыйЭл.Наименование="Новенький22";
	//НовыйЭл.Записать();
	//Фрм=V8.ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаОбъекта",);
	//Фрм=НовыйЭл.ПолучитьФорму();
	//Фрм.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура НаСервере(Команда)
	КнопкаВыполнитьНажатие();
КонецПроцедуры
 
 
&НаКлиентеНаСервереБезКонтекста
Функция СформироватьСтрокуПодключения() Экспорт
	СтрокаПодключения=""; Ошибка=Ложь;
	
	Файловый=Истина;
	ПутьДоБазы=Константы.ПутьДоПриемника.Получить();
	ИмяСервера="";  ИмяИБНаСервере="";
	Логин="Usr1"; Пароль="";
	
	Если Файловый  Тогда
		
		Если ПустаяСтрока(ПутьДоБазы) Тогда
			
			Сообщить("Не задан каталог информационной базы для установки соединения", СтатусСообщения.Важное);
			Ошибка = Истина;
			
		КонецЕсли;
		
		СтрокаПодключения = "File=""" + ПутьДоБазы + """";
	Иначе
		
		Если ПустаяСтрока(ИмяСервера) Тогда
			
			Сообщить("Не задано имя сервера 1С:Предприятия информационной базы для установки соединения", СтатусСообщения.Важное);
			Ошибка = Истина;
			
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяИБНаСервере) Тогда
			
			Сообщить("Не задано имя информационной базы для установки соединения на сервере 1С:Предприятия", СтатусСообщения.Важное);
			Ошибка = Истина;
			
		КонецЕсли;		
		
		СтрокаПодключения = "Srvr = """ + ИмяСервера + """; Ref = """ + ИмяИБНаСервере + """";		
		
	КонецЕсли;
	

	Если НЕ ПустаяСтрока(Логин) Тогда
		СтрокаПодключения = СтрокаПодключения + ";Usr = """ + Логин + """";
	КонецЕсли;
	Если НЕ ПустаяСтрока(Пароль) Тогда
		СтрокаПодключения = СтрокаПодключения + ";Pwd = """ + Пароль + """";
	КонецЕсли;
	
	Если Ошибка Тогда
		Возврат("");
	Иначе
		Возврат(СтрокаПодключения);
	КонецЕсли;
	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста       
Функция УстановитьOLEСоединение(СтрокаПодключения) Экспорт
	Попытка
		
		Подключение = Новый COMОбъект("v83.Application");
		conn = Подключение.Connect(СтрокаПодключения);
			
	Исключение
		
		СтрокаСообщенияОбОшибке = "При попытке соединения по OLE произошла следующая ошибка:" + Символы.ПС 
						+ ОписаниеОшибки();
		Сообщить(СтрокаСообщенияОбОшибке, СтатусСообщения.Важное);
							
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат Подключение;
	
КонецФункции

&НаСервере
Процедура КнопкаВыполнитьНажатие()
	//V8=УстановитьOLEСоединение(СформироватьСтрокуПодключения());;
	//
	//Сообщить(V8.Константы.Задваивать.Получить());
	//Номен=V8.Справочники.Номенклатура;
	//НовыйЭл=Номен.СоздатьЭлемент();       
	//НовыйЭл.Наименование="Новенький22";
	//НовыйЭл.Записать();
	//Фрм=НовыйЭл.ПолучитьФорму();
	//Фрм.ОткрытьМодально();
КонецПроцедуры



