
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Попытка
		
		ЧислоКоличество = число(СокрЛП(Количество));
		Если ЗначениеЗаполнено(СокрЛП(Количество)) И ТипЗнч(ЧислоКоличество) = тип("Число") тогда
			
			ЭтаФорма.Закрыть(число(СокрЛП(Количество)));
			
		Иначе
			Предупреждение("Введите количество");
		КонецЕсли;
	
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Количество.РедактированиеТекста = Истина;
	
	Количество = 0;
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
	#Если МобильныйКлиент Тогда    
		НачатьРедактированиеЭлемента();
	#КонецЕсли
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//
		
КонецПроцедуры
