
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Инвентаризация = Параметры.Инвентаризация;
	НомерПросчета = Параметры.НомерПросчета;
	
	
	Список.Параметры.УстановитьЗначениеПараметра("Склад",Инвентаризация.Склад);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	ОбновитьСписок();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок()
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Ячейка = ВыбраннаяСтрока;
	
	Парам = Новый Структура("Инвентаризация, НомерПросчета, Ячейка", Инвентаризация, НомерПросчета, Ячейка);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбновитьСписокЗавершение",ЭтотОбъект,);
	ОткрытьФорму("Обработка.ТСД_РСК.Форма.РСК_ПервичныйВводИнвентаризации",Парам,,,,,ОписаниеОповещенияОЗакрытии);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование"
		И ИмяСобытия = "Barcode"
		И ВводДоступен()	// нужен ли ВводДоступен() в окне где нет определённого поля, куда сканировать ?
		Тогда
		//проверка даты на сервере и на ТСД
		//Сообщить("ТекущаяДата() на клиенте:" + ТекущаяДата());
		//Сообщить("ТекущаяДата() на сервере:" + ПолучитьТекущаяДатанаСервере());
		//Сообщить("ТекущаяДатаСеанса() на сервере:" + ПолучитьТекущаяДатаСеансаНаСервере());
		
		Штрихкод = Параметр;
		// ищем номенклатуру
		ОбработатьШтрихкод(Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Попытка
	
		ВК.ИнициализироватьСканер(Ложь, Истина);	
	
	Исключение
		
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Попытка
	
		ВК.ОтключитьСканер();
	
	Исключение
	
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод)

	Ячейка = ПолучитьЯчейкуПоШК(Штрихкод);
	Если ЗначениеЗаполнено(Ячейка) Тогда
		ПараметрыФормы  = Новый Структура("Инвентаризация, НомерПросчета, Ячейка", Инвентаризация, НомерПросчета, Ячейка);
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбновитьСписокЗавершение",ЭтотОбъект,);
		ОткрытьФорму("Обработка.ТСД_РСК.Форма.РСК_ПервичныйВводИнвентаризации", ПараметрыФормы,,,,,ОписаниеОповещенияОЗакрытии); 
	КонецЕсли;

КонецПроцедуры // ОбработатьШтрихкод()

&НаСервере
Функция ПолучитьЯчейкуПоШК(Штрихкод)

	Возврат Справочники.СкладскиеЯчейки.НайтиПоКоду(Штрихкод,,,Инвентаризация.Склад);

КонецФункции // ПолучитьЯчейкуПоШК()
 
 
