
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОсновнойСклад = Параметры.ОсновнойСклад;
	Склад = Параметры.Склад;
	ИтоговаяИнвентаризация = Параметры.ИтоговаяИнвентаризация;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если НЕ МобильныйКлиент Тогда
		Элементы.ФормаЭмитацияСканера.Видимость = Истина;	
	#КонецЕсли
	
	Попытка
	
		ВК.ИнициализироватьСканер(Ложь, Истина);	
	
	Исключение
		
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Попытка
	
		ВК.ОтключитьСканер();
	
	Исключение
	
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование"
		И ИмяСобытия = "Barcode"
		И ВводДоступен()	// нужен ли ВводДоступен() в окне где нет определённого поля, куда сканировать ?
		Тогда
		//проверка даты на сервере и на ТСД
		//Сообщить("ТекущаяДата() на клиенте:" + ТекущаяДата());
		//Сообщить("ТекущаяДата() на сервере:" + ПолучитьТекущаяДатанаСервере());
		//Сообщить("ТекущаяДатаСеанса() на сервере:" + ПолучитьТекущаяДатаСеансаНаСервере());
		
		Штрихкод = Параметр;
		
		ОбработатьШтрихкод(Штрихкод);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод)
	
	//предупреждения проверки
	СуммаПоказателей = Группа + Линия + Место + Ячейка;
	Если СуммаПоказателей = 0 Тогда
		Предупреждение("Заполните в адрес и группу");
		Возврат;
	КонецЕсли;
	
	Структура =	НайтиНоменклатуруУпаковкуПоШтрихкодуСтруктура(Штрихкод);
	// нашли - Структура("Номенклатура, УпаковкаПоШтрихкоду, МинимУпаковка (по ед. изм. номенклатуры)"
	Если НЕ ЗначениеЗаполнено(Структура.Номенклатура) Тогда
		МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
		Предупреждение("Номенклатура с таким Штрихкодом не существует !");
		Возврат;
	КонецЕсли;
	
	Если АвтоСуммУп Тогда
		Если НЕ ЗначениеЗаполнено(Структура.УпаковкаПоШтрихкоду) Тогда
			МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
			Предупреждение("Упаковка с таким Штрихкодом не существует !");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ АвтоСуммУп Тогда
		ПарамКоличества = Новый Структура("Номенклатура, Упаковка, Группа, ПросчетНомер", Структура.Номенклатура, Структура.МинимУпаковка, Группа, ПросчетНомер);
		КоличествоДобавить = ОткрытьФормуМодально("Обработка.ТСД_РСК.Форма.ВводКоличестваИнвентаризация", ПарамКоличества);
		КоличествоДобавить = ?(ЗначениеЗаполнено(КоличествоДобавить), КоличествоДобавить, 0);
	Иначе 
		//КоличествоДобавить = количество коэффициент из упаковки
		КоличествоДобавить = ПолучитьКоэфУпаковки(Структура.УпаковкаПоШтрихкоду);
	КонецЕсли;
	
	Если КоличествоДобавить > 0 Тогда
		
		//
		Удачно = ДобавитьВводДанных(КоличествоДобавить, Структура);
		Если Удачно Тогда
			
			ВыделитьСтрокуСНоменклатуройЦветом(Структура.Номенклатура);
			
			ОбновитьТЗ();
			
			УстановитьТекущуюСтроку(Структура.Номенклатура);
			
			МобильныйКлиент.ОповещениеКороткоеОдинСигнал();
		Иначе
			МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
		КонецЕсли;
		
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.ТЗ;

КонецПроцедуры

&НаСервере
Процедура ВыделитьСтрокуСНоменклатуройЦветом(Знач Номенклатура)
	
	//условное оформление
	//УсловноеОформление.Элементы.Очистить()
	УсловноеОформление.Элементы[0].Отбор.Элементы[0].ПравоеЗначение 	= Номенклатура;
	УсловноеОформление.Элементы[0].Отбор.Элементы[0].Использование		= Истина;
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТЗНоменклатура");
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТЗ.Номенклатура");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = СтрокаТЧПоступления.Номенклатура;
	////Элемент.Использование = Истина;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗолотистый);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюСтроку(Знач Номенклатура)
	
	Перем СтрокиСНоменклатурой;
	
	//выделить строку с отсканированной номенклатурой. Найти надо по текущему коробу именно
	СтрокиСНоменклатурой = ТЗ.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
	Если СтрокиСНоменклатурой.Количество() > 0 тогда
		Элементы.ТЗ.ТекущаяСтрока = СтрокиСНоменклатурой[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьКоэфУпаковки(Знач Упаковка_)
	
	Возврат Упаковка_.Коэффициент;

КонецФункции // ОбработатьШтрихкод(Штрихкод)()

&НаСервере
Функция ПолучитьУпаковкуПоЕдИзмНоменклатуры(Ном)

	// Подставляется ед изм. ШТ так как сами ввели в ручную номенклатуру 
	//в этом случае нет информации о упаковке(ед. изм.)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиНоменклатуры.Ссылка КАК УпаковкаШт
		|ИЗ
		|	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
		|ГДЕ
		|	УпаковкиНоменклатуры.Владелец = &Номенклатура
		|	И УпаковкиНоменклатуры.ЕдиницаИзмерения = &ЕдиницаИзмерения
		|	И НЕ УпаковкиНоменклатуры.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Ном.ЕдиницаИзмерения);	//Шт
	Запрос.УстановитьПараметр("Номенклатура", Ном);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.УпаковкаШт;
	КонецЦикла;
	
	

КонецФункции // ЗаполнитьУпаковкуШТ()

&НаСервере
Функция НайтиНоменклатуруУпаковкуПоШтрихкодуСтруктура(Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Номенклатура,
		|	ШтрихкодыНоменклатуры.Упаковка КАК УпаковкаПоШтрихкоду
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МинимУпаковка = ПолучитьУпаковкуПоЕдИзмНоменклатуры(ВыборкаДетальныеЗаписи.Номенклатура);
		Возврат Новый Структура("Номенклатура, УпаковкаПоШтрихкоду, МинимУпаковка", ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.УпаковкаПоШтрихкоду, МинимУпаковка);
	КонецЦикла;
	
	Возврат Новый Структура("Номенклатура, УпаковкаПоШтрихкоду, МинимУпаковка", , , );
	
КонецФункции // НайтиНоменклатуруПоШтрихкоду()

&НаСервере
Процедура ОбновитьТЗ()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентаризацияПросчеты.Номенклатура КАК Номенклатура,
		|	СУММА(ИнвентаризацияПросчеты.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.ИнвентаризацияПросчеты КАК ИнвентаризацияПросчеты
		|ГДЕ
		|	ИнвентаризацияПросчеты.ИтоговаяИнвентаризация = &ИтоговаяИнвентаризация
		|	И ИнвентаризацияПросчеты.ПросчетНомер = &ПросчетНомер
		|	И ИнвентаризацияПросчеты.Группа = &Группа
		|	И ИнвентаризацияПросчеты.ПользовательТСД = &ПользовательТСД
		|	И ИнвентаризацияПросчеты.Склад = &Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	ИнвентаризацияПросчеты.Номенклатура";
	
	Запрос.УстановитьПараметр("ИтоговаяИнвентаризация",ИтоговаяИнвентаризация);
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("ПользовательТСД", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ПросчетНомер", ПросчетНомер);
	
	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(),"ТЗ");
	
	

КонецПроцедуры // ОбновитьСписок()

&НаСервере
Функция ДобавитьВводДанных(КоличествоДобавить, Структура)
	// нашли - Структура("Номенклатура, УпаковкаПоШтрихкоду, МинимУпаковка (по ед. изм. номенклатуры)"
	
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.ИнвентаризацияПросчеты.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ИтоговаяИнвентаризация = ИтоговаяИнвентаризация;
		МенеджерЗаписи.Склад = Склад;
		МенеджерЗаписи.Номенклатура = Структура.Номенклатура;
		МенеджерЗаписи.ПросчетНомер = ПросчетНомер;
		МенеджерЗаписи.Группа = Группа;
		МенеджерЗаписи.ПользовательТСД = Пользователи.ТекущийПользователь();
		
		МенеджерЗаписи.Прочитать();
		
		//нет - добавляем
		Если НЕ МенеджерЗаписи.Выбран() Тогда	
			МенеджерЗаписи.ИтоговаяИнвентаризация = ИтоговаяИнвентаризация;
			МенеджерЗаписи.Склад = Склад;
			МенеджерЗаписи.Номенклатура = Структура.Номенклатура;
			МенеджерЗаписи.ПросчетНомер = ПросчетНомер;
			МенеджерЗаписи.Группа = Группа;
			МенеджерЗаписи.ПользовательТСД = Пользователи.ТекущийПользователь();
			
			МенеджерЗаписи.Количество = МенеджерЗаписи.Количество + КоличествоДобавить;		// прибавляем с имеющемуся количеству, но тут всё равно 0 + КоличествоДобавить
			МенеджерЗаписи.Записать();
			
		Иначе	// есть - то суммируем к имеющейся записи - 1 одна
			// в данном случае поля менеджера записи не очищаются !
			//заполнять поля не нужно
			
			МенеджерЗаписи.Количество = МенеджерЗаписи.Количество + КоличествоДобавить;		// прибавляем с имеющемуся количеству
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
		////////////////////////////////////////////////
		
		
		Возврат Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

КонецФункции // ДобавитьВводДанных()


&НаСервере
Функция УдалитьСтрокуВводДанных(Структура)
	Попытка
		
		// нашли - Структура("Номенклатура, УпаковкаПоШтрихкоду, МинимУпаковка (по ед. изм. номенклатуры)"
		//Структура для поиска: Строки = Док.Данные.НайтиСтроки(Новый Структура("Номенклатура, ЕдиницаИзмерения, Группа, ПросчетНомер", Структура.Номенклатура, Структура.МинимУпаковка, Группа, ПросчетНомер));
		
		НаборЗаписей = РегистрыСведений.ИнвентаризацияПросчеты.СоздатьНаборЗаписей();
		//НаборЗаписей.
		
		НаборЗаписей.Отбор.ИтоговаяИнвентаризация.Установить(ИтоговаяИнвентаризация);
		НаборЗаписей.Отбор.Склад.Установить(Склад);
		НаборЗаписей.Отбор.Группа.Установить(Группа);
		НаборЗаписей.Отбор.ПользовательТСД.Установить(Пользователи.ТекущийПользователь());
		НаборЗаписей.Отбор.ПросчетНомер.Установить(ПросчетНомер);
		НаборЗаписей.Отбор.Номенклатура.Установить(Структура.Номенклатура);
		//НаборЗаписей.Отбор.Количество.Установить(КоличествоДобавить;
		НаборЗаписей.Записать();
		
		Возврат Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

КонецФункции // ДобавитьВводДанных()

&НаСервере
Функция МодульЧисла(Число)
     Возврат Макс(Число, -Число);

 КонецФункции
 
&НаСервере
Функция УдалитьВводДанных(КоличествоУдалить, Структура)
	Попытка
		
		// нашли - Структура("Номенклатура, УпаковкаПоШтрихкоду, МинимУпаковка (по ед. изм. номенклатуры)"
		//НаборЗаписей.
		НаборЗаписей = РегистрыСведений.ИнвентаризацияПросчеты.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИтоговаяИнвентаризация.Установить(ИтоговаяИнвентаризация);
		НаборЗаписей.Отбор.Склад.Установить(Склад);
		НаборЗаписей.Отбор.Группа.Установить(Группа);
		НаборЗаписей.Отбор.ПользовательТСД.Установить(Пользователи.ТекущийПользователь());
		НаборЗаписей.Отбор.ПросчетНомер.Установить(ПросчетНомер);
		НаборЗаписей.Отбор.Номенклатура.Установить(Структура.Номенклатура);
		НаборЗаписей.Прочитать();
		массивУдаляемых = Новый Массив;
		Если НаборЗаписей.Количество() > 0 Тогда
			КоличествоУдалитьОсталось = КоличествоУдалить;
			
			Для Каждого Набор из НаборЗаписей Цикл
				
				Остаток =  Набор.Количество - КоличествоУдалитьОсталось;
				
				Если Остаток <= 0 Тогда	//удалить строчку
					КоличествоУдалитьОсталось = КоличествоУдалитьОсталось - Набор.Количество;
					массивУдаляемых.Добавить(Набор);
					
				Иначе	// записываем количество остаток
					КоличествоУдалитьОсталось = КоличествоУдалитьОсталось - Набор.Количество;
					Набор.Количество = Остаток;
				КонецЕсли;
				
				//КоличествоУдалитьОсталось = КоличествоУдалитьОсталось - МодульЧисла(Остаток);
				
				Если КоличествоУдалитьОсталось <= 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			//удалить массивУдаляемых
			Для Каждого Наб из массивУдаляемых Цикл 
				НаборЗаписей.Удалить(Наб);
			КонецЦикла;
			НаборЗаписей.Записать();
			
			Возврат Истина;
		КонецЕсли
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

КонецФункции // ДобавитьВводДанных()

&НаСервере
Процедура ОчиститьФорму()

	//Номенклатура = Неопределено;
	//Упаковка = Неопределено;
	//ШК = "";

КонецПроцедуры // ОчиститьФорму()

&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	ОбновитьТЗ();
КонецПроцедуры

&НаКлиенте
Процедура ЛинияПриИзменении(Элемент)
	ОбновитьТЗ();
КонецПроцедуры

&НаКлиенте
Процедура МестоПриИзменении(Элемент)
	ОбновитьТЗ();
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаПриИзменении(Элемент)
	ОбновитьТЗ();
КонецПроцедуры

&НаКлиенте
Процедура ТЗОбработкаЗапросаОбновления()
	ОбновитьТЗ();
КонецПроцедуры

&НаКлиенте
Процедура ТЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = ТЗ.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Структура =	Новый Структура("Номенклатура, УпаковкаПоШтрихкоду, МинимУпаковка", ТекущиеДанные.Номенклатура, , ПолучитьУпаковкуПоЕдИзмНоменклатуры(ТекущиеДанные.Номенклатура));
	// нашли - Структура("Номенклатура, УпаковкаПоШтрихкоду, МинимУпаковка (по ед. изм. номенклатуры)"
	
	МассивДействий = Новый Массив;
	МассивДействий.Добавить("ДобавитьКоличество");
	МассивДействий.Добавить("УдалитьКоличество");
	МассивДействий.Добавить("УдалитьСтроку");
	//МассивДействий.Добавить("ДобавитьНовуюНоменклатуру");
	МассивДействий.Добавить("Отмена");
	
	Парам = Новый Структура("МассивДействий, Номенклатура", МассивДействий, ТекущиеДанные.Номенклатура);
		Ответ = ОткрытьФормуМодально("Обработка.ТСД_РСК.Форма.ДействияСНоменклатурой",Парам);
		Если Не ЗначениеЗаполнено(Ответ) Тогда 
			Возврат;
		КонецЕсли;
		
		Если Ответ = "ДобавитьКоличество" Тогда
			
			ПарамКоличества = Новый Структура("Номенклатура, Упаковка, Группа, ПросчетНомер", Структура.Номенклатура, Структура.МинимУпаковка, Группа, ПросчетНомер);
			КоличествоДобавить = ОткрытьФормуМодально("Обработка.ТСД_РСК.Форма.ВводКоличестваИнвентаризация", ПарамКоличества);
			КоличествоДобавить = ?(ЗначениеЗаполнено(КоличествоДобавить), КоличествоДобавить, 0);
			
			Если КоличествоДобавить > 0 Тогда
				Удачно = ДобавитьВводДанных(КоличествоДобавить, Структура);
				Если Удачно Тогда
					
					ВыделитьСтрокуСНоменклатуройЦветом(Структура.Номенклатура);
					ОбновитьТЗ();
					УстановитьТекущуюСтроку(Структура.Номенклатура);
					
					МобильныйКлиент.ОповещениеКороткоеОдинСигнал();
				Иначе
					МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
				КонецЕсли;			
			КонецЕсли;
			
		ИначеЕсли Ответ = "УдалитьКоличество" Тогда
			ПарамКоличества = Новый Структура("Номенклатура, Упаковка, Группа, ПросчетНомер", Структура.Номенклатура, Структура.МинимУпаковка, Группа, ПросчетНомер);
			КоличествоУдалить = ОткрытьФормуМодально("Обработка.ТСД_РСК.Форма.ВводКоличестваИнвентаризация", ПарамКоличества);
			КоличествоУдалить = ?(ЗначениеЗаполнено(КоличествоУдалить), КоличествоУдалить, 0);
			
			Если КоличествоУдалить > 0 Тогда
				Удачно = УдалитьВводДанных(КоличествоУдалить, Структура);
				Если Удачно Тогда
					
					ВыделитьСтрокуСНоменклатуройЦветом(Структура.Номенклатура);
					ОбновитьТЗ();
					УстановитьТекущуюСтроку(Структура.Номенклатура);
					
					МобильныйКлиент.ОповещениеКороткоеОдинСигнал();
				Иначе
					МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
				КонецЕсли;			
			КонецЕсли;

			
		ИначеЕсли Ответ = "УдалитьСтроку" Тогда
			Ответ = Вопрос("Действительно Удалить строку с номенклатурой и всё кол-во ?", РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
					Удачно = УдалитьСтрокуВводДанных(Структура);
					Если Удачно Тогда
						
						ВыделитьСтрокуСНоменклатуройЦветом(Структура.Номенклатура);
						ОбновитьТЗ();
						//УстановитьТекущуюСтроку(Структура.Номенклатура);
						
						МобильныйКлиент.ОповещениеКороткоеОдинСигнал();
					Иначе
						МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
					КонецЕсли;			
				
			КонецЕсли;
			
		//ИначеЕсли Ответ = "ДобавитьНовуюНоменклатуру" Тогда
			//
			
		КонецЕсли;
		ЭтаФорма.ТекущийЭлемент = Элементы.ТЗ;
			
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовуюНом(Команда)
	
	ПарамКоличества = Новый Структура("Номенклатура, Упаковка, Группа, ПросчетНомер", , , Группа, ПросчетНомер);
	Ответ = ОткрытьФормуМодально("Обработка.ТСД_РСК.Форма.ВводКоличестваИнвентаризацияНоваяНомеклатура", ПарамКоличества);
	//Ответ = Новый Структура("номенклатура, Упаковка, МинимУпаковка, КоличествоДобавить" -  МинимУпаковка (по ед. изм. номенклатуры)"
	
	КоличествоДобавить = ?(ЗначениеЗаполнено(Ответ), Ответ.КоличествоДобавить, 0);
	
	Если КоличествоДобавить > 0 Тогда
		
		//
		Удачно = ДобавитьВводДанных(КоличествоДобавить, Ответ);
		Если Удачно Тогда
			
			ВыделитьСтрокуСНоменклатуройЦветом(Ответ.Номенклатура);
			
			ОбновитьТЗ();
			
			УстановитьТекущуюСтроку(Ответ.Номенклатура);
			
			МобильныйКлиент.ОповещениеКороткоеОдинСигнал();
		Иначе
			МобильныйКлиент.ОповещениеПродолжительноеДваСигнала();
		КонецЕсли;
		
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.ТЗ;
КонецПроцедуры

&НаКлиенте
Процедура ПросчетНомерПриИзменении(Элемент)
	мРазрешенныхНомеровПросчетов = Новый Массив;
	мРазрешенныхНомеровПросчетов.Добавить(2);
	мРазрешенныхНомеровПросчетов.Добавить(3);
	
	Индекс = мРазрешенныхНомеровПросчетов.Найти(ПросчетНомер);	//есди нетв разрешён. номерах
	Если Индекс = Неопределено Тогда		//нельзя пропускать такой номер просчета
		ПросчетНомер = 0;
		Предупреждение("Просчет может быть 2 или 3!");
	КонецЕсли;
	
	ОбновитьТЗ();
КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриИзменении(Элемент)
	
	ОбновитьТЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПросчетНомер1ПриИзменении(Элемент)
	
	ОбновитьТЗ();

КонецПроцедуры

&НаКлиенте
Процедура ЭмитацияСканера(Команда)
	ШК = "";
	Если ВвестиСтроку(ШК,"Введите Штрихкод для имитации работы сканера",30,Ложь) Тогда
		ШК = СокрЛП(Строка(ШК));
		ШК = СтрЗаменить(ШК, Символы.нпп,"");
		ОбработкаОповещения("Barcode",ШК,"ПодключаемоеОборудование");
	КонецЕсли;
КонецПроцедуры








