
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда	//если это новый элемент
		
		Если Параметры.Свойство("ТекстЗаполнения") Тогда
			Если СокрЛП(Параметры.ТекстЗаполнения) <> "" Тогда
				Объект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
				Объект.Наименование = Параметры.ТекстЗаполнения;
				Объект.Описание = Параметры.ТекстЗаполнения;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущийЭлемент = Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы["ФормаЗаписатьИЗакрыть"];
		
	КонецЕсли;
КонецПроцедуры
