
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Попытка
	
		ЧислоКоличество = Число(СокрЛП(Количество));
		Если ЧислоКоличество > 0 Тогда
			Закрыть(ЧислоКоличество);
		КонецЕсли;
		
	Исключение
		ВызватьИсключение;
		Закрыть(0);
	КонецПопытки;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Количество.РедактированиеТекста = Истина;
	
	Коробка = "";
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
	#Если МобильныйКлиент Тогда    
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры
