
Процедура ДобавитьВремяКЗадаче(Исполнитель, ДеньРаботы, План, Передано, Задача, ОтделЗаказчик, Заказчик, Статус, Минут, Часов, ДобавитьМинут, Начало, Окончание, НовоеОкончание) Экспорт

	МенеджерЗаписи = РегистрыСведений.Задачи.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Исполнитель = Исполнитель;
	МенеджерЗаписи.ДеньРаботы = ДеньРаботы;
	МенеджерЗаписи.План = План;
	МенеджерЗаписи.Передано = Передано;
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.ОтделЗаказчик = ОтделЗаказчик;
	МенеджерЗаписи.Заказчик = Заказчик;
	МенеджерЗаписи.Начало = Начало;
	МенеджерЗаписи.Окончание = Окончание;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.Минут = Минут;
	МенеджерЗаписи.Часов = Часов;
	
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		
		//существует - перезаписываем
		МенеджерЗаписи.Исполнитель = Исполнитель;
		МенеджерЗаписи.ДеньРаботы = ДеньРаботы;
		МенеджерЗаписи.План = План;
		МенеджерЗаписи.Передано = Передано;
		МенеджерЗаписи.Задача = Задача;
		МенеджерЗаписи.ОтделЗаказчик = ОтделЗаказчик;
		МенеджерЗаписи.Заказчик = Заказчик;
		МенеджерЗаписи.Начало = Начало;
		МенеджерЗаписи.Окончание = НовоеОкончание;
		МенеджерЗаписи.Статус = Статус;
		МенеджерЗаписи.Минут = Минут;
		МенеджерЗаписи.Часов = Часов;
		
		МенеджерЗаписи.Минут = МенеджерЗаписи.Минут + ДобавитьМинут;
		МенеджерЗаписи.Часов = МенеджерЗаписи.Минут / 60;
		
		МенеджерЗаписи.Записать(Истина);
		
	Иначе 
		
		//
		
	КонецЕсли;
	
КонецПроцедуры
