
&НаКлиенте
Процедура Подтвердить(Команда)
	Закрыть(СокрЛП(ПостМесто));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВК.ИнициализироватьСканер(Ложь, Истина);
	
	Элементы.ПостМесто.РедактированиеТекста = Истина;
	
	ПостМесто = "";
	Элементы.ПостМесто.ОбновитьТекстРедактирования();
	Элементы.ПостМесто.Видимость = Ложь;
	Элементы.ПостМесто.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ПостМесто;
	#Если МобильныйКлиент Тогда    
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ВК.ОтключитьСканер();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование"
		И ИмяСобытия = "Barcode"
		И ВводДоступен()	// нужен ли ВводДоступен() в окне где нет определённого поля, куда сканировать ?
		Тогда	
		Если СокрЛП(Параметр) <> "" Тогда
			ПостМесто = СокрЛП(Параметр);
			Подтвердить(Неопределено);	//сразу закрываем при сканировании
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
