
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОсновнойСклад = Параметры.ОсновнойСклад;
	Склад = Параметры.Склад;
	ИтоговаяИнвентаризация = Параметры.ИтоговаяИнвентаризация;
	
	Список.Параметры.УстановитьЗначениеПараметра("ГруппаСкладов",ОсновнойСклад.Родитель);
	Список.Параметры.УстановитьЗначениеПараметра("ИтоговаяИнвентаризация",ИтоговаяИнвентаризация);
	Список.Параметры.УстановитьЗначениеПараметра("Склад",Склад);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель",Пользователи.ТекущийПользователь());
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Парам = Новый Структура("ОсновнойСклад, Склад, ИтоговаяИнвентаризация, ВводДанных", ОсновнойСклад, Склад, ИтоговаяИнвентаризация, ВыбраннаяСтрока);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбновитьСписокЗавершение",ЭтотОбъект,);
	ОткрытьФорму("Обработка.ТСД_РСК.Форма.ПервичныйВводИнвентаризацииТаблица", Парам,,,,,ОписаниеОповещенияОЗакрытии);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйВводДанных(Команда)
	
	ВводДанных = СоздатьНовыйвводДанныхНаСервере();
	Если ЗначениеЗаполнено(ВводДанных) Тогда
		Парам = Новый Структура("ОсновнойСклад, Склад, ИтоговаяИнвентаризация, ВводДанных", ОсновнойСклад, Склад, ИтоговаяИнвентаризация, ВводДанных);
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбновитьСписокЗавершение",ЭтотОбъект,);
		ОткрытьФорму("Обработка.ТСД_РСК.Форма.ПервичныйВводИнвентаризацииТаблица", Парам,,,,,ОписаниеОповещенияОЗакрытии);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьНовыйвводДанныхНаСервере()

	Док = Документы.ВводДанныхИнвентаризации.СоздатьДокумент();
	Док.Дата = ТекущаяДатаСеанса();
	Док.ИтоговаяИнвентаризация = ИтоговаяИнвентаризация;
	Док.Склад = Склад;
	Док.Исполнитель = Пользователи.ТекущийПользователь();
	Док.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат Док.Ссылка;

КонецФункции // СоздатьНовыйвводДанныхНаСервере()

