
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОсновнойСклад 	= Параметры.ОсновнойСклад;
	Список.Параметры.УстановитьЗначениеПараметра("Склад",ОсновнойСклад);
	// отгруз. листы со статусом Обработка по ТСД
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Парам = Новый Структура("ОсновнойСклад, ОтгрузочныйЛист", ОсновнойСклад, ВыбраннаяСтрока);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбновитьСписокЗавершение",ЭтотОбъект,);
	
	ОткрытьФорму("Обработка.ТСД_РСК.Форма.ОтгрузкаПоЛисту",парам,,,,,ОписаниеОповещенияОЗакрытии);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Попытка
	
		ВК.ИнициализироватьСканер(Ложь, Истина);
	
	Исключение
	
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Попытка
	
		ВК.ОтключитьСканер();
	
	Исключение
	
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование"
		И ИмяСобытия = "Barcode"
		И ВводДоступен()	// нужен ли ВводДоступен() в окне где нет определённого поля, куда сканировать ?
		Тогда	
		
		//найти отгруз. лист
		ШК = Параметр;
		Если Лев(ШК,3) = "003" Тогда
			
			ОтгрузочныйЛист = НайтиОтгрузЛистПоШК(ШК);
			Если ЗначениеЗаполнено(ОтгрузочныйЛист) Тогда
				
				Парам = Новый Структура("ОтгрузочныйЛист, ОсновнойСклад", ОтгрузочныйЛист, ОсновнойСклад);
				ОткрытьФорму("Обработка.ТСД_РСК.Форма.ОтгрузкаПоЛисту", Парам);
				
			Иначе
				Предупреждение("Отгрузочный лист не найден !");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиОтгрузЛистПоШК(ШК)

	//статус Обработка по ТСД
	Номер	= Сред(ШК,4,9);
	
	Дата 	= Сред(ШК,13,6);
	Дата	= ПолучитьДатуДок(Дата);
	
	//
	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.СтатусыОЛ.ОбработкаПоТСД);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтгрузочныйЛист.Ссылка КАК Документ
		|ИЗ
		|	Документ.ОтгрузочныйЛист КАК ОтгрузочныйЛист
		|ГДЕ
		|	ОтгрузочныйЛист.Проведен
		|	И ОтгрузочныйЛист.Статус В(&Статусы)
		|	И ОтгрузочныйЛист.Склад = &ОсновнойСклад
		|	И ОтгрузочныйЛист.ДатаОтгрузки = &Дата
		|	И ОтгрузочныйЛист.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("ОсновнойСклад", ОсновнойСклад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Документ;
	КонецЦикла;
	
	Возврат Документы.ОтгрузочныйЛист.ПустаяСсылка();
	
КонецФункции // НайтиОтгрузЛистПоШК()

&НаСервере
Функция ПолучитьДатуДок(СтрокаДата)
	Год 	= "20" + Сред(СтрокаДата,5,2);
	Месяц   = Сред(СтрокаДата,3,2);
	День    = Сред(СтрокаДата,1,2);
	Возврат Дата(Год,Месяц,День);

КонецФункции // ПоискРеализацииПоШК()

