
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = СокрЛП(Пользователи.ТекущийПользователь());
	
	Список.Параметры.УстановитьЗначениеПараметра("ГруппаСкладов", Пользователи.ТекущийПользователь().ГруппаСкладов);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЛист(Команда)
	
	УпаковочныйЛист = СоздатьУпаковочныйЛист();
	Если ЗначениеЗаполнено(УпаковочныйЛист) Тогда
		Парам = Новый Структура("УпаковочныйЛист", УпаковочныйЛист);
		ОткрытьФорму("Обработка.ТСД_РСК.Форма.УпаковочныйЛист",Парам);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция СоздатьУпаковочныйЛист()

	Док = Документы.УпаковочныйЛист.СоздатьДокумент();
	Док.Дата = ТекущаяДатаСеанса();
	Док.Вид = Перечисления.ВидыУпаковочныхЛистов.Исходящий;
	Док.СкладУпаковки = Склад_РСК.ПолучитьСкладТекущегоПользователя();
	Док.Упаковал = Пользователи.ТекущийПользователь();
	Попытка
		НачатьТранзакцию();
		Док.Код = Документы.УпаковочныйЛист.ПолучитьКодНового();
		ЗафиксироватьТранзакцию();
		
		Док.Записать(РежимЗаписиДокумента.Запись);
		
		Возврат Док.Ссылка;
	Исключение
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецПопытки;
	
	
	
	
КонецФункции // СоздатьУпаковочныйЛист()


&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Попытка
	
		ВК.ИнициализироватьСканер(Ложь, Истина);	
	
	Исключение
		
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Попытка
	
		ВК.ОтключитьСканер();
	
	Исключение
	
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Парам = Новый Структура("УпаковочныйЛист", ВыбраннаяСтрока);
	ОткрытьФорму("Обработка.ТСД_РСК.Форма.УпаковочныйЛист",Парам);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование"
		И ИмяСобытия = "Barcode"
		И ВводДоступен()	// нужен ли ВводДоступен() в окне где нет определённого поля, куда сканировать ?
		Тогда
		//проверка даты на сервере и на ТСД
		//Сообщить("ТекущаяДата() на клиенте:" + ТекущаяДата());
		//Сообщить("ТекущаяДата() на сервере:" + ПолучитьТекущаяДатанаСервере());
		//Сообщить("ТекущаяДатаСеанса() на сервере:" + ПолучитьТекущаяДатаСеансаНаСервере());
		
		Штрихкод = Параметр;
		
		УпаковочныйЛист = ПолучитьУпаковочныйЛистПоШК(СокрЛП(Штрихкод));
		Если ЗначениеЗаполнено(УпаковочныйЛист) Тогда 
			ОткрытьФорму("Обработка.ТСД_РСК.Форма.УпаковочныйЛист",Новый Структура("УпаковочныйЛист", УпаковочныйЛист));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУпаковочныйЛистПоШК(Штрихкод)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковочныйЛист.Ссылка
		|ИЗ
		|	Документ.УпаковочныйЛист КАК УпаковочныйЛист
		|ГДЕ
		|	НЕ УпаковочныйЛист.ПометкаУдаления
		|	И УпаковочныйЛист.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
	
КонецФункции // ОбработатьШтрихкод()

