
&НаСервере
Процедура ВыполнитьНаСервере()
	
	// Вставить содержимое обработчика.
	//HTTPСоединение
	//HTTPЗапрос
	//HTTPОтвет
	//Модуль HTTP-сервиса
	
	
	Индекс = "248033";
	СтрокаЗапроса = "http://api.openweathermap.org/data/2.5/weather?q="+Индекс+"&lang=ru&appid=b1b35bba8b434a28a0be2a3e1071ae5b&units=imperial";
	
	// В сети есть сайт http://example.com
    // Запросим содержимое его главной страницы.
 
    // Подключаемся к сайту.
    Соединение = Новый HTTPСоединение(
        "api.openweathermap.org", // сервер (хост)
        80, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        , // таймаут в секундах, 0 или пусто - не устанавливать
          // защищенное соединение, если используется https
    );
 
    // Получаем текст корневой страницы через GET-запрос.
    Запрос = Новый HTTPЗапрос("/data/2.5/weather?q="+Индекс+"&lang=ru&appid=b1b35bba8b434a28a0be2a3e1071ae5b&units=imperial");
    // Если бы нужна была другая страница, мы бы указали,
    // например, "/about" или "/news".
 
    Результат = Соединение.Получить(Запрос);
 
    Сообщить("Нам вернули код: " + Результат.КодСостояния);
    // Что примерно означают коды результата запроса:
    // [100, 299] - хороший код возврата
    // [300, 399] - нас перенаправляют на другую страницу,
    //              причём 302 - код постоянного перенаправления
    // [400, 499] - ошибка запроса
    // [500, 599] - ошибка сервера
 
    // в теле результата запроса - текст обычной html страницы
    Сообщить("Тело результата: " + Результат.ПолучитьТелоКакСтроку());
	
	Ответ = Результат.ПолучитьТелоКакСтроку();
	
	//
	ЧтениеJSON = Новый ЧтениеJSON;
	//Или из строки
	ЧтениеJSON.УстановитьСтроку(Ответ);
	//Или из файла	
	//ЧтениеJSON.ОткрытьФайл("C:\test.txt");
	СтруктураОтвет = ПрочитатьJSON(ЧтениеJSON);	
	ЧтениеJSON.Закрыть();

	
	А=0;
	//СтруктураОтвет
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКом(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры
