
&НаКлиенте
Процедура РаботаСФайлом(Команда)
	Файл = Новый Файл(Объект.ПутьДоФайла);
	Если Файл.ЭтоФайл() Тогда
		Если Файл.Размер()>300000 Тогда
			Сообщить("Не нужно такой файл отправлять по почте!");
		КонецЕсли;
		Сообщить("Изменен: "+Строка(Файл.ПолучитьВремяИзменения()));
	Иначе
		Сообщить("Выбран каталог");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьДоФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Режим=РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла=Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла="";
	Фильтр="Текст(*,txt)|*.txt";
	ДиалогОткрытияФайла.Фильтр=Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор=Ложь;
	ДиалогОткрытияФайла.Заголовок="Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьДоФайла=ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ПередатьФайлОбъекта(Адрес)
	ДвоичныеДанные=ПолучитьИзВременногоХранилища(Адрес);
	ИмяФайла = ПолучитьИмяВременногоФайла(".txt");
	ДвоичныеДанные.Записать(ИмяФайла);
	//продолжаем работу...
КонецПроцедуры	

&НаКлиенте
Процедура СКлиентаНаСервер(Команда)
	Перем Имя,Адрес;
	Если ПоместитьФайл(Адрес,"",Имя,Истина,УникальныйИдентификатор) Тогда
		Объект.ПутьДоФайла=Имя;
		ПередатьФайлОбъекта(Адрес);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ССервераНаКлиента(Команда)
	Адрес=СходитьЗаФайлом();
	Если ПолучитьФайл(Адрес,Объект.ПутьДоФайла,Истина) Тогда
		//файл сохранен в файловую систему клиента
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СходитьЗаФайлом()

	ДД=Новый ДвоичныеДанные(Объект.ПутьДоФайла);
	Адрес=ПоместитьВоВременноеХранилище(ДД, УникальныйИдентификатор);
	Возврат(Адрес);

КонецФункции  