
&НаКлиенте
Процедура УпаковкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(Элементы.Упаковки.ТекущиеДанные.Упаковка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номенклатура = Параметры.Номенклатура;
	ЗаполнитьУпаковкиПоНоменклатуре();
	
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьУпаковкиПоНоменклатуре()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиНоменклатуры.Ссылка КАК Упаковка,
		|	УпаковкиНоменклатуры.Коэффициент
		|ИЗ
		|	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
		|ГДЕ
		|	УпаковкиНоменклатуры.Владелец = &Номенклатура
		|	И НЕ УпаковкиНоменклатуры.ПометкаУдаления
		|	И УпаковкиНоменклатуры.ОсновнаяУпаковка
		|	И УпаковкиНоменклатуры.ЕдиницаИзмерения <> &ЕдиницаИзмеренияШТ
		|
		|УПОРЯДОЧИТЬ ПО
		|	УпаковкиНоменклатуры.Наименование";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияШТ", Справочники.ЕдиницыИзмерения.НайтиПоКоду("796"));	// Шт
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Упаковки.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	
	
КонецПроцедуры // НайтиНоменклатуруПоШтрихкоду()