
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОсновнойСклад = Параметры.ОсновнойСклад;
	Склад = Параметры.Склад;
	ИтоговаяИнвентаризация = Параметры.ИтоговаяИнвентаризация;
	
	Заголовок = ИтоговаяИнвентаризация.Номер;
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйВводДанных(Команда)
	
	Парам = Новый Структура("ОсновнойСклад, Склад, ИтоговаяИнвентаризация", ОсновнойСклад, Склад, ИтоговаяИнвентаризация);
	//ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбновитьСписокЗавершение",ЭтотОбъект,);
	//ОткрытьФорму("Обработка.ТСД_РСК.Форма.ВыборВариантаИнвентаризации",Парам,,,,,ОписаниеОповещенияОЗакрытии);
	ОткрытьФорму("Обработка.ТСД_РСК.Форма.СписокПервичныхВводовДанных", Парам);
	
КонецПроцедуры

&НаКлиенте
Процедура ВторичныйПоследующие(Команда)
	
	Парам = Новый Структура("ОсновнойСклад, Склад, ИтоговаяИнвентаризация", ОсновнойСклад, Склад, ИтоговаяИнвентаризация);
	ОткрытьФорму("Обработка.ТСД_РСК.Форма.ВторичныйПоследующиеПросчетыТаблица", Парам);
	
КонецПроцедуры
