
&НаКлиенте
Процедура СобственноеПодключение(Команда)
	СобственноеПодключениеСервер();
КонецПроцедуры

&НаСервере
Процедура СобственноеПодключениеСервер()
	
	ВИД=ВнешниеИсточникиДанных.DBF.ПолучитьСостояние();
	Если Вид=СостояниеВнешнегоИсточникаДанных.Отключен Тогда
		ПСВИД = Новый ПараметрыСоединенияВнешнегоИсточникаДанных;
		ПСВИД.СтрокаСоединения= "DSN=A3";
		ВнешниеИсточникиДанных.DBF.УстановитьОбщиеПараметрыСоединения(ПСВИД);
		ВнешниеИсточникиДанных.DBF.УстановитьСоединение();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавлениеДанныхНаСервере()
	ОВИ=ВнешниеИсточникиДанных.DBF.Таблицы.nomen.СоздатьОбъект();
	ОВИ.DESCR="Новый";
	ОВИ.CODE=99;
	ОВИ.ED="м";
	ОВИ.KOEFF=1;
	ОВИ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеДанных(Команда)
	ДобавлениеДанныхНаСервере();
КонецПроцедуры
